cask_args appdir: "~/Applications", require_sha: true

mas "Magnet", id: 441258766

cask "iterm2"
cask "brave-browser"
cask "1password"
cask "notion"
cask "notion-calendar"
cask "alfred"
cask "istat-menus"
cask "karabiner-elements"

cask "slack"
cask "discord"
# cask "visual-studio-code"

cask "windsurf"
cask "mountain-duck"
cask "zoom"
cask "figma"
cask "postgres-unofficial"
cask "tableplus"

cask "tripmode"
cask "screenflow"

cask "spotify", args: { require_sha: false }
cask "dropbox"
cask "vlc"
cask "airflow"
cask "bartender"
cask "beeper"
