cask_args appdir: "~/Applications", require_sha: true

# Utility
cask "brave-browser"
cask "1password", appdir: "/Applications"
brew "1password-cli"
cask "notion"
mas "Magnet", id: 441258766
cask "notion-calendar"
cask "alfred"
cask "slack"
cask "discord"

# Mods
cask "bartender"
cask "topnotch"
cask "istat-menus"
cask "karabiner-elements"

# Dev
cask "iterm2"
brew "nvim"
brew "ncdu"
brew "icdiff"
brew "heroku"
brew "direnv"
brew "ack"
brew "gh"
brew "tree"
brew "pv"

cask "windsurf"
# cask "visual-studio-code"
cask "tableplus"
cask "postgres-unofficial"
brew "redis"
brew "memcached"
cask "chromedriver"

# Apps
cask "screenflow"
cask "screen-studio"
cask "spotify", args: { require_sha: false }
cask "dropbox"
cask "vlc"
cask "beeper"
cask "zoom"
cask "figma"
cask "licecap"
mas "Day One", id: 1055511498

# Connectivity
cask "mountain-duck"
mas "WireGuard", id: 1451685025
cask "tailscale"
cask "tripmode"
cask "airflow"
